# brew bundle
# brew link --force readline curl
# pip install -U awscli awsebcli pgcli
# brew cask install vagrant

tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/gui'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'stefansundin/tap'

# basic tools
brew 'bash'
brew 'bash-completion'
brew 'curl'
brew 'duti'
brew 'git'
brew 'gnu-tar'
brew 'openssl'
brew 'readline'
brew 'wget'
brew 'xz'

# linux tools
brew 'gnupg2'
brew 'gpg-agent'
brew 'pinentry-mac'
brew 'htop'
brew 'imagemagick', args: ['with-libtiff', 'with-ghostscript']
brew 'jq'
brew 'p7zip'
brew 'pngcrush'
brew 'ssh-copy-id'
brew 'tmux'
brew 'watch'
brew 'youtube-dl'

# development
brew 'certbot'
brew 'colordiff'
brew 'go'
brew 'jsonpp'
brew 'python'
brew 'python3'
brew 'redis'
brew 'sqlite'

# newer version of ssh
brew 'openssh'

# node 6 (AWS Lambda is running 6.10)
brew 'node@6'

# AWS
brew 'packer'
brew 'aws-rotate-key'

# docker
# brew 'docker'
# brew 'docker-compose'

# casks
cask 'webpquicklook'

# misc
cask 'vlc-protocol'
