# brew bundle
# brew link --force readline curl
# pip install -U awsebcli pgcli youtube-dl

tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask'
tap 'stefansundin/tap'

# basic tools
brew 'bash'
brew 'bash-completion@2'
brew 'coreutils'
brew 'curl'
brew 'duti'
brew 'git'
brew 'tig'
brew 'gnu-tar'
brew 'gcal'
brew 'openssl'
brew 'readline'
brew 'wget'
brew 'xz'

# linux tools
brew 'gnupg'
brew 'pinentry-mac'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'p7zip'
brew 'pngcrush'
brew 'ssh-copy-id'
brew 'tmux'
brew 'watch'
brew 'rsync'

# development
brew 'certbot'
brew 'colordiff'
brew 'go'
brew 'jsonpp'
brew 'python'
brew 'redis'
brew 'sqlite'

# newer version of ssh
brew 'openssh'

# my stuff:
cask 'vlc-protocol'

# docker
# brew 'docker'
# brew 'docker-compose'
brew 'docker-credential-helper-ecr'

# casks
cask 'keepingyouawake'
cask 'brewservicesmenubar'
cask 'menubar-countdown'
cask 'disk-inventory-x'
cask 'vagrant'
cask 'mpv'
cask 'sublime-text'
cask 'sublime-merge'
cask 'webpquicklook'
cask 'qlmarkdown'
cask 'google-cloud-sdk'
# cask 'inkscape'
# cask 'google-earth-pro'
